layer {
  name: "data"
  type: "Input"
  top: "img_l"
  input_param { shape: { dim: 1 dim: 3 dim: 384 dim: 1280 } }
}
layer {
  name: "data"
  type: "Input"
  top: "flow"
  input_param { shape: { dim: 1 dim: 3 dim: 384 dim: 1280 } }
}
layer {
  name: "rec_flow1"
  type: "Mean"
  bottom: "flow"
  top: "rec_flow1"
  mean_param {
    operation: SUBTRACT
    value: 128.0
    value: 128.0
    value: 0.0
  }
}
layer {
  name: "seg1_conv1_2"
  type: "Convolution"
  bottom: "img_l"
  top: "seg1_conv1_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 3
    kernel_size: 7
    stride: 2
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn_conv1_2"
  type: "BatchNorm"
  bottom: "seg1_conv1_2"
  top: "seg1_conv1_2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale_conv1_2"
  type: "Scale"
  bottom: "seg1_conv1_2"
  top: "seg1_conv1_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_conv1_2_relu"
  type: "ReLU"
  bottom: "seg1_conv1_2"
  top: "seg1_conv1_2"
}
layer {
  name: "seg1_pool1_2"
  type: "Pooling"
  bottom: "seg1_conv1_2"
  top: "seg1_pool1_2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
    pad: 0
  }
}
layer {
  name: "seg1_res2a_branch2a"
  type: "Convolution"
  bottom: "seg1_pool1_2"
  top: "seg1_res2a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn2a_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res2a_branch2a"
  top: "seg1_res2a_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale2a_branch2a"
  type: "Scale"
  bottom: "seg1_res2a_branch2a"
  top: "seg1_res2a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res2a_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res2a_branch2a"
  top: "seg1_res2a_branch2a"
}
layer {
  name: "seg1_res2a_branch2b"
  type: "Convolution"
  bottom: "seg1_res2a_branch2a"
  top: "seg1_res2a_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn2a_branch2b"
  type: "BatchNorm"
  bottom: "seg1_res2a_branch2b"
  top: "seg1_res2a_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale2a_branch2b"
  type: "Scale"
  bottom: "seg1_res2a_branch2b"
  top: "seg1_res2a_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res2a_branch2b_relu"
  type: "ReLU"
  bottom: "seg1_res2a_branch2b"
  top: "seg1_res2a_branch2b"
}
layer {
  name: "seg1_res2a_branch2c"
  type: "Convolution"
  bottom: "seg1_res2a_branch2b"
  top: "seg1_res2a_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn2a_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res2a_branch2c"
  top: "seg1_res2a_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale2a_branch2c"
  type: "Scale"
  bottom: "seg1_res2a_branch2c"
  top: "seg1_res2a_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res2a_branch1"
  type: "Convolution"
  bottom: "seg1_pool1_2"
  top: "seg1_res2a_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn2a_branch1"
  type: "BatchNorm"
  bottom: "seg1_res2a_branch1"
  top: "seg1_res2a_branch1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale2a_branch1"
  type: "Scale"
  bottom: "seg1_res2a_branch1"
  top: "seg1_res2a_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res2a"
  type: "Eltwise"
  bottom: "seg1_res2a_branch2c"
  bottom: "seg1_res2a_branch1"
  top: "seg1_res2a"
}
layer {
  name: "seg1_res2a_relu"
  type: "ReLU"
  bottom: "seg1_res2a"
  top: "seg1_res2a"
}
layer {
  name: "seg1_res2b_branch2a"
  type: "Convolution"
  bottom: "seg1_res2a"
  top: "seg1_res2b_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn2b_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res2b_branch2a"
  top: "seg1_res2b_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale2b_branch2a"
  type: "Scale"
  bottom: "seg1_res2b_branch2a"
  top: "seg1_res2b_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res2b_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res2b_branch2a"
  top: "seg1_res2b_branch2a"
}
layer {
  name: "seg1_res2b_branch2b"
  type: "Convolution"
  bottom: "seg1_res2b_branch2a"
  top: "seg1_res2b_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn2b_branch2b"
  type: "BatchNorm"
  bottom: "seg1_res2b_branch2b"
  top: "seg1_res2b_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale2b_branch2b"
  type: "Scale"
  bottom: "seg1_res2b_branch2b"
  top: "seg1_res2b_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res2b_branch2b_relu"
  type: "ReLU"
  bottom: "seg1_res2b_branch2b"
  top: "seg1_res2b_branch2b"
}
layer {
  name: "seg1_res2b_branch2c"
  type: "Convolution"
  bottom: "seg1_res2b_branch2b"
  top: "seg1_res2b_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn2b_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res2b_branch2c"
  top: "seg1_res2b_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale2b_branch2c"
  type: "Scale"
  bottom: "seg1_res2b_branch2c"
  top: "seg1_res2b_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res2b"
  type: "Eltwise"
  bottom: "seg1_res2b_branch2c"
  bottom: "seg1_res2a"
  top: "seg1_res2b"
}
layer {
  name: "seg1_res2b_relu"
  type: "ReLU"
  bottom: "seg1_res2b"
  top: "seg1_res2b"
}
layer {
  name: "seg1_res2c_branch2a"
  type: "Convolution"
  bottom: "seg1_res2b"
  top: "seg1_res2c_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn2c_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res2c_branch2a"
  top: "seg1_res2c_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale2c_branch2a"
  type: "Scale"
  bottom: "seg1_res2c_branch2a"
  top: "seg1_res2c_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res2c_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res2c_branch2a"
  top: "seg1_res2c_branch2a"
}
layer {
  name: "seg1_res2c_branch2b"
  type: "Convolution"
  bottom: "seg1_res2c_branch2a"
  top: "seg1_res2c_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn2c_branch2b"
  type: "BatchNorm"
  bottom: "seg1_res2c_branch2b"
  top: "seg1_res2c_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale2c_branch2b"
  type: "Scale"
  bottom: "seg1_res2c_branch2b"
  top: "seg1_res2c_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res2c_branch2b_relu"
  type: "ReLU"
  bottom: "seg1_res2c_branch2b"
  top: "seg1_res2c_branch2b"
}
layer {
  name: "seg1_res2c_branch2c"
  type: "Convolution"
  bottom: "seg1_res2c_branch2b"
  top: "seg1_res2c_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn2c_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res2c_branch2c"
  top: "seg1_res2c_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale2c_branch2c"
  type: "Scale"
  bottom: "seg1_res2c_branch2c"
  top: "seg1_res2c_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res2c"
  type: "Eltwise"
  bottom: "seg1_res2c_branch2c"
  bottom: "seg1_res2b"
  top: "seg1_res2c"
}
layer {
  name: "seg1_res2c_relu"
  type: "ReLU"
  bottom: "seg1_res2c"
  top: "seg1_res2c"
}
layer {
  name: "seg1_res3a_branch2a"
  type: "Convolution"
  bottom: "seg1_res2c"
  top: "seg1_res3a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3a_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res3a_branch2a"
  top: "seg1_res3a_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3a_branch2a"
  type: "Scale"
  bottom: "seg1_res3a_branch2a"
  top: "seg1_res3a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3a_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res3a_branch2a"
  top: "seg1_res3a_branch2a"
}
layer {
  name: "seg1_res3a_branch2b"
  type: "Convolution"
  bottom: "seg1_res3a_branch2a"
  top: "seg1_res3a_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3a_branch2b"
  type: "BatchNorm"
  bottom: "seg1_res3a_branch2b"
  top: "seg1_res3a_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3a_branch2b"
  type: "Scale"
  bottom: "seg1_res3a_branch2b"
  top: "seg1_res3a_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3a_branch2b_relu"
  type: "ReLU"
  bottom: "seg1_res3a_branch2b"
  top: "seg1_res3a_branch2b"
}
layer {
  name: "seg1_res3a_branch2c"
  type: "Convolution"
  bottom: "seg1_res3a_branch2b"
  top: "seg1_res3a_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3a_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res3a_branch2c"
  top: "seg1_res3a_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3a_branch2c"
  type: "Scale"
  bottom: "seg1_res3a_branch2c"
  top: "seg1_res3a_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3a_branch1"
  type: "Convolution"
  bottom: "seg1_res2c"
  top: "seg1_res3a_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3a_branch1"
  type: "BatchNorm"
  bottom: "seg1_res3a_branch1"
  top: "seg1_res3a_branch1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3a_branch1"
  type: "Scale"
  bottom: "seg1_res3a_branch1"
  top: "seg1_res3a_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3a"
  type: "Eltwise"
  bottom: "seg1_res3a_branch2c"
  bottom: "seg1_res3a_branch1"
  top: "seg1_res3a"
}
layer {
  name: "seg1_res3a_relu"
  type: "ReLU"
  bottom: "seg1_res3a"
  top: "seg1_res3a"
}
layer {
  name: "seg1_res3b_branch2a"
  type: "Convolution"
  bottom: "seg1_res3a"
  top: "seg1_res3b_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3b_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res3b_branch2a"
  top: "seg1_res3b_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3b_branch2a"
  type: "Scale"
  bottom: "seg1_res3b_branch2a"
  top: "seg1_res3b_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3b_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res3b_branch2a"
  top: "seg1_res3b_branch2a"
}
layer {
  name: "seg1_res3b_branch2b"
  type: "Convolution"
  bottom: "seg1_res3b_branch2a"
  top: "seg1_res3b_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3b_branch2b"
  type: "BatchNorm"
  bottom: "seg1_res3b_branch2b"
  top: "seg1_res3b_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3b_branch2b"
  type: "Scale"
  bottom: "seg1_res3b_branch2b"
  top: "seg1_res3b_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3b_branch2b_relu"
  type: "ReLU"
  bottom: "seg1_res3b_branch2b"
  top: "seg1_res3b_branch2b"
}
layer {
  name: "seg1_res3b_branch2c"
  type: "Convolution"
  bottom: "seg1_res3b_branch2b"
  top: "seg1_res3b_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3b_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res3b_branch2c"
  top: "seg1_res3b_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3b_branch2c"
  type: "Scale"
  bottom: "seg1_res3b_branch2c"
  top: "seg1_res3b_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3b"
  type: "Eltwise"
  bottom: "seg1_res3b_branch2c"
  bottom: "seg1_res3a"
  top: "seg1_res3b"
}
layer {
  name: "seg1_res3b_relu"
  type: "ReLU"
  bottom: "seg1_res3b"
  top: "seg1_res3b"
}
layer {
  name: "seg1_res3c_branch2a"
  type: "Convolution"
  bottom: "seg1_res3b"
  top: "seg1_res3c_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3c_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res3c_branch2a"
  top: "seg1_res3c_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3c_branch2a"
  type: "Scale"
  bottom: "seg1_res3c_branch2a"
  top: "seg1_res3c_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3c_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res3c_branch2a"
  top: "seg1_res3c_branch2a"
}
layer {
  name: "seg1_res3c_branch2b"
  type: "Convolution"
  bottom: "seg1_res3c_branch2a"
  top: "seg1_res3c_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3c_branch2b"
  type: "BatchNorm"
  bottom: "seg1_res3c_branch2b"
  top: "seg1_res3c_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3c_branch2b"
  type: "Scale"
  bottom: "seg1_res3c_branch2b"
  top: "seg1_res3c_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3c_branch2b_relu"
  type: "ReLU"
  bottom: "seg1_res3c_branch2b"
  top: "seg1_res3c_branch2b"
}
layer {
  name: "seg1_res3c_branch2c"
  type: "Convolution"
  bottom: "seg1_res3c_branch2b"
  top: "seg1_res3c_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3c_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res3c_branch2c"
  top: "seg1_res3c_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3c_branch2c"
  type: "Scale"
  bottom: "seg1_res3c_branch2c"
  top: "seg1_res3c_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3c"
  type: "Eltwise"
  bottom: "seg1_res3c_branch2c"
  bottom: "seg1_res3b"
  top: "seg1_res3c"
}
layer {
  name: "seg1_res3c_relu"
  type: "ReLU"
  bottom: "seg1_res3c"
  top: "seg1_res3c"
}
layer {
  name: "seg1_res3d_branch2a"
  type: "Convolution"
  bottom: "seg1_res3c"
  top: "seg1_res3d_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3d_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res3d_branch2a"
  top: "seg1_res3d_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3d_branch2a"
  type: "Scale"
  bottom: "seg1_res3d_branch2a"
  top: "seg1_res3d_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3d_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res3d_branch2a"
  top: "seg1_res3d_branch2a"
}
layer {
  name: "seg1_res3dconv1_2_p1"
  type: "Convolution"
  bottom: "seg1_res3d_branch2a"
  top: "seg1_res3dconv1_2_p1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3d_dil1"
  type: "BatchNorm"
  bottom: "seg1_res3dconv1_2_p1"
  top: "seg1_res3dconv1_2_p1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3d_dil1"
  type: "Scale"
  bottom: "seg1_res3dconv1_2_p1"
  top: "seg1_res3dconv1_2_p1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3drelu1_2"
  type: "ReLU"
  bottom: "seg1_res3dconv1_2_p1"
  top: "seg1_res3dconv1_2_p1"
}
layer {
  name: "seg1_res3dconv1_2_p2"
  type: "Convolution"
  bottom: "seg1_res3d_branch2a"
  top: "seg1_res3dconv1_2_p2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 2
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
    dilation: 2
  }
}
layer {
  name: "seg1_bn3d_dil2"
  type: "BatchNorm"
  bottom: "seg1_res3dconv1_2_p2"
  top: "seg1_res3dconv1_2_p2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3d_dil2"
  type: "Scale"
  bottom: "seg1_res3dconv1_2_p2"
  top: "seg1_res3dconv1_2_p2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3drelu1_2_p2"
  type: "ReLU"
  bottom: "seg1_res3dconv1_2_p2"
  top: "seg1_res3dconv1_2_p2"
}
layer {
  name: "seg1_3ddil_sum"
  type: "Concat"
  bottom: "seg1_res3dconv1_2_p1"
  bottom: "seg1_res3dconv1_2_p2"
  top: "seg1_3ddil_sum"
}
layer {
  name: "seg1_res3d_branch2c"
  type: "Convolution"
  bottom: "seg1_3ddil_sum"
  top: "seg1_res3d_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn3d_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res3d_branch2c"
  top: "seg1_res3d_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale3d_branch2c"
  type: "Scale"
  bottom: "seg1_res3d_branch2c"
  top: "seg1_res3d_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res3d"
  type: "Eltwise"
  bottom: "seg1_res3d_branch2c"
  bottom: "seg1_res3c"
  top: "seg1_res3d"
}
layer {
  name: "seg1_res3d_relu"
  type: "ReLU"
  bottom: "seg1_res3d"
  top: "seg1_res3d"
}
layer {
  name: "seg1_res4a_branch2a"
  type: "Convolution"
  bottom: "seg1_res3d"
  top: "seg1_res4a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4a_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res4a_branch2a"
  top: "seg1_res4a_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4a_branch2a"
  type: "Scale"
  bottom: "seg1_res4a_branch2a"
  top: "seg1_res4a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4a_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res4a_branch2a"
  top: "seg1_res4a_branch2a"
}
layer {
  name: "seg1_res4a_branch2b"
  type: "Convolution"
  bottom: "seg1_res4a_branch2a"
  top: "seg1_res4a_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4a_branch2b"
  type: "BatchNorm"
  bottom: "seg1_res4a_branch2b"
  top: "seg1_res4a_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4a_branch2b"
  type: "Scale"
  bottom: "seg1_res4a_branch2b"
  top: "seg1_res4a_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4a_branch2b_relu"
  type: "ReLU"
  bottom: "seg1_res4a_branch2b"
  top: "seg1_res4a_branch2b"
}
layer {
  name: "seg1_res4a_branch2c"
  type: "Convolution"
  bottom: "seg1_res4a_branch2b"
  top: "seg1_res4a_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4a_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res4a_branch2c"
  top: "seg1_res4a_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4a_branch2c"
  type: "Scale"
  bottom: "seg1_res4a_branch2c"
  top: "seg1_res4a_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4a_branch1"
  type: "Convolution"
  bottom: "seg1_res3d"
  top: "seg1_res4a_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4a_branch1"
  type: "BatchNorm"
  bottom: "seg1_res4a_branch1"
  top: "seg1_res4a_branch1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4a_branch1"
  type: "Scale"
  bottom: "seg1_res4a_branch1"
  top: "seg1_res4a_branch1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4a"
  type: "Eltwise"
  bottom: "seg1_res4a_branch2c"
  bottom: "seg1_res4a_branch1"
  top: "seg1_res4a"
}
layer {
  name: "seg1_res4a_relu"
  type: "ReLU"
  bottom: "seg1_res4a"
  top: "seg1_res4a"
}
layer {
  name: "seg1_res4b_branch2a"
  type: "Convolution"
  bottom: "seg1_res4a"
  top: "seg1_res4b_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4b_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res4b_branch2a"
  top: "seg1_res4b_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4b_branch2a"
  type: "Scale"
  bottom: "seg1_res4b_branch2a"
  top: "seg1_res4b_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4b_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res4b_branch2a"
  top: "seg1_res4b_branch2a"
}
layer {
  name: "seg1_res4b_branch2b"
  type: "Convolution"
  bottom: "seg1_res4b_branch2a"
  top: "seg1_res4b_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4b_branch2b"
  type: "BatchNorm"
  bottom: "seg1_res4b_branch2b"
  top: "seg1_res4b_branch2b"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4b_branch2b"
  type: "Scale"
  bottom: "seg1_res4b_branch2b"
  top: "seg1_res4b_branch2b"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4b_branch2b_relu"
  type: "ReLU"
  bottom: "seg1_res4b_branch2b"
  top: "seg1_res4b_branch2b"
}
layer {
  name: "seg1_res4b_branch2c"
  type: "Convolution"
  bottom: "seg1_res4b_branch2b"
  top: "seg1_res4b_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4b_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res4b_branch2c"
  top: "seg1_res4b_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4b_branch2c"
  type: "Scale"
  bottom: "seg1_res4b_branch2c"
  top: "seg1_res4b_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4b"
  type: "Eltwise"
  bottom: "seg1_res4b_branch2c"
  bottom: "seg1_res4a"
  top: "seg1_res4b"
}
layer {
  name: "seg1_res4b_relu"
  type: "ReLU"
  bottom: "seg1_res4b"
  top: "seg1_res4b"
}
layer {
  name: "seg1_res4c_branch2a"
  type: "Convolution"
  bottom: "seg1_res4b"
  top: "seg1_res4c_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4c_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res4c_branch2a"
  top: "seg1_res4c_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4c_branch2a"
  type: "Scale"
  bottom: "seg1_res4c_branch2a"
  top: "seg1_res4c_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4c_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res4c_branch2a"
  top: "seg1_res4c_branch2a"
}
layer {
  name: "seg1_res4cconv1_2_p1"
  type: "Convolution"
  bottom: "seg1_res4c_branch2a"
  top: "seg1_res4cconv1_2_p1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4c_dil1"
  type: "BatchNorm"
  bottom: "seg1_res4cconv1_2_p1"
  top: "seg1_res4cconv1_2_p1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4c_dil1"
  type: "Scale"
  bottom: "seg1_res4cconv1_2_p1"
  top: "seg1_res4cconv1_2_p1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4crelu1_2"
  type: "ReLU"
  bottom: "seg1_res4cconv1_2_p1"
  top: "seg1_res4cconv1_2_p1"
}
layer {
  name: "seg1_res4cconv1_2_p2"
  type: "Convolution"
  bottom: "seg1_res4c_branch2a"
  top: "seg1_res4cconv1_2_p2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 2
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
    dilation: 2
  }
}
layer {
  name: "seg1_bn4c_dil2"
  type: "BatchNorm"
  bottom: "seg1_res4cconv1_2_p2"
  top: "seg1_res4cconv1_2_p2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4c_dil2"
  type: "Scale"
  bottom: "seg1_res4cconv1_2_p2"
  top: "seg1_res4cconv1_2_p2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4crelu1_2_p2"
  type: "ReLU"
  bottom: "seg1_res4cconv1_2_p2"
  top: "seg1_res4cconv1_2_p2"
}
layer {
  name: "seg1_4cdil_sum"
  type: "Concat"
  bottom: "seg1_res4cconv1_2_p1"
  bottom: "seg1_res4cconv1_2_p2"
  top: "seg1_4cdil_sum"
}
layer {
  name: "seg1_res4c_branch2c"
  type: "Convolution"
  bottom: "seg1_4cdil_sum"
  top: "seg1_res4c_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4c_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res4c_branch2c"
  top: "seg1_res4c_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4c_branch2c"
  type: "Scale"
  bottom: "seg1_res4c_branch2c"
  top: "seg1_res4c_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4c"
  type: "Eltwise"
  bottom: "seg1_res4c_branch2c"
  bottom: "seg1_res4b"
  top: "seg1_res4c"
}
layer {
  name: "seg1_res4c_relu"
  type: "ReLU"
  bottom: "seg1_res4c"
  top: "seg1_res4c"
}
layer {
  name: "seg1_res4d_branch2a"
  type: "Convolution"
  bottom: "seg1_res4c"
  top: "seg1_res4d_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4d_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res4d_branch2a"
  top: "seg1_res4d_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4d_branch2a"
  type: "Scale"
  bottom: "seg1_res4d_branch2a"
  top: "seg1_res4d_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4d_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res4d_branch2a"
  top: "seg1_res4d_branch2a"
}
layer {
  name: "seg1_res4dconv1_2_p1"
  type: "Convolution"
  bottom: "seg1_res4d_branch2a"
  top: "seg1_res4dconv1_2_p1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4d_dil1"
  type: "BatchNorm"
  bottom: "seg1_res4dconv1_2_p1"
  top: "seg1_res4dconv1_2_p1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4d_dil1"
  type: "Scale"
  bottom: "seg1_res4dconv1_2_p1"
  top: "seg1_res4dconv1_2_p1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4drelu1_2"
  type: "ReLU"
  bottom: "seg1_res4dconv1_2_p1"
  top: "seg1_res4dconv1_2_p1"
}
layer {
  name: "seg1_res4dconv1_2_p2"
  type: "Convolution"
  bottom: "seg1_res4d_branch2a"
  top: "seg1_res4dconv1_2_p2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 4
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
    dilation: 4
  }
}
layer {
  name: "seg1_bn4d_dil2"
  type: "BatchNorm"
  bottom: "seg1_res4dconv1_2_p2"
  top: "seg1_res4dconv1_2_p2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4d_dil2"
  type: "Scale"
  bottom: "seg1_res4dconv1_2_p2"
  top: "seg1_res4dconv1_2_p2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4drelu1_2_p2"
  type: "ReLU"
  bottom: "seg1_res4dconv1_2_p2"
  top: "seg1_res4dconv1_2_p2"
}
layer {
  name: "seg1_4ddil_sum"
  type: "Concat"
  bottom: "seg1_res4dconv1_2_p1"
  bottom: "seg1_res4dconv1_2_p2"
  top: "seg1_4ddil_sum"
}
layer {
  name: "seg1_res4d_branch2c"
  type: "Convolution"
  bottom: "seg1_4ddil_sum"
  top: "seg1_res4d_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4d_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res4d_branch2c"
  top: "seg1_res4d_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4d_branch2c"
  type: "Scale"
  bottom: "seg1_res4d_branch2c"
  top: "seg1_res4d_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4d"
  type: "Eltwise"
  bottom: "seg1_res4d_branch2c"
  bottom: "seg1_res4c"
  top: "seg1_res4d"
}
layer {
  name: "seg1_res4d_relu"
  type: "ReLU"
  bottom: "seg1_res4d"
  top: "seg1_res4d"
}
layer {
  name: "seg1_res4e_branch2a"
  type: "Convolution"
  bottom: "seg1_res4d"
  top: "seg1_res4e_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4e_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res4e_branch2a"
  top: "seg1_res4e_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4e_branch2a"
  type: "Scale"
  bottom: "seg1_res4e_branch2a"
  top: "seg1_res4e_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4e_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res4e_branch2a"
  top: "seg1_res4e_branch2a"
}
layer {
  name: "seg1_res4econv1_2_p1"
  type: "Convolution"
  bottom: "seg1_res4e_branch2a"
  top: "seg1_res4econv1_2_p1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4e_dil1"
  type: "BatchNorm"
  bottom: "seg1_res4econv1_2_p1"
  top: "seg1_res4econv1_2_p1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4e_dil1"
  type: "Scale"
  bottom: "seg1_res4econv1_2_p1"
  top: "seg1_res4econv1_2_p1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4erelu1_2"
  type: "ReLU"
  bottom: "seg1_res4econv1_2_p1"
  top: "seg1_res4econv1_2_p1"
}
layer {
  name: "seg1_res4econv1_2_p2"
  type: "Convolution"
  bottom: "seg1_res4e_branch2a"
  top: "seg1_res4econv1_2_p2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 8
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
    dilation: 8
  }
}
layer {
  name: "seg1_bn4e_dil2"
  type: "BatchNorm"
  bottom: "seg1_res4econv1_2_p2"
  top: "seg1_res4econv1_2_p2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4e_dil2"
  type: "Scale"
  bottom: "seg1_res4econv1_2_p2"
  top: "seg1_res4econv1_2_p2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4erelu1_2_p2"
  type: "ReLU"
  bottom: "seg1_res4econv1_2_p2"
  top: "seg1_res4econv1_2_p2"
}
layer {
  name: "seg1_4edil_sum"
  type: "Concat"
  bottom: "seg1_res4econv1_2_p1"
  bottom: "seg1_res4econv1_2_p2"
  top: "seg1_4edil_sum"
}
layer {
  name: "seg1_res4e_branch2c"
  type: "Convolution"
  bottom: "seg1_4edil_sum"
  top: "seg1_res4e_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4e_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res4e_branch2c"
  top: "seg1_res4e_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4e_branch2c"
  type: "Scale"
  bottom: "seg1_res4e_branch2c"
  top: "seg1_res4e_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4e"
  type: "Eltwise"
  bottom: "seg1_res4e_branch2c"
  bottom: "seg1_res4d"
  top: "seg1_res4e"
}
layer {
  name: "seg1_res4e_relu"
  type: "ReLU"
  bottom: "seg1_res4e"
  top: "seg1_res4e"
}
layer {
  name: "seg1_res4f_branch2a"
  type: "Convolution"
  bottom: "seg1_res4e"
  top: "seg1_res4f_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4f_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res4f_branch2a"
  top: "seg1_res4f_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4f_branch2a"
  type: "Scale"
  bottom: "seg1_res4f_branch2a"
  top: "seg1_res4f_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4f_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res4f_branch2a"
  top: "seg1_res4f_branch2a"
}
layer {
  name: "seg1_res4fconv1_2_p1"
  type: "Convolution"
  bottom: "seg1_res4f_branch2a"
  top: "seg1_res4fconv1_2_p1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4f_dil1"
  type: "BatchNorm"
  bottom: "seg1_res4fconv1_2_p1"
  top: "seg1_res4fconv1_2_p1"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4f_dil1"
  type: "Scale"
  bottom: "seg1_res4fconv1_2_p1"
  top: "seg1_res4fconv1_2_p1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4frelu1_2"
  type: "ReLU"
  bottom: "seg1_res4fconv1_2_p1"
  top: "seg1_res4fconv1_2_p1"
}
layer {
  name: "seg1_res4fconv1_2_p2"
  type: "Convolution"
  bottom: "seg1_res4f_branch2a"
  top: "seg1_res4fconv1_2_p2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 16
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    engine: CAFFE
    dilation: 16
  }
}
layer {
  name: "seg1_bn4f_dil2"
  type: "BatchNorm"
  bottom: "seg1_res4fconv1_2_p2"
  top: "seg1_res4fconv1_2_p2"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4f_dil2"
  type: "Scale"
  bottom: "seg1_res4fconv1_2_p2"
  top: "seg1_res4fconv1_2_p2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4frelu1_2_p2"
  type: "ReLU"
  bottom: "seg1_res4fconv1_2_p2"
  top: "seg1_res4fconv1_2_p2"
}
layer {
  name: "seg1_4fdil_sum"
  type: "Concat"
  bottom: "seg1_res4fconv1_2_p1"
  bottom: "seg1_res4fconv1_2_p2"
  top: "seg1_4fdil_sum"
}
layer {
  name: "seg1_res4f_branch2c"
  type: "Convolution"
  bottom: "seg1_4fdil_sum"
  top: "seg1_res4f_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn4f_branch2c"
  type: "BatchNorm"
  bottom: "seg1_res4f_branch2c"
  top: "seg1_res4f_branch2c"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale4f_branch2c"
  type: "Scale"
  bottom: "seg1_res4f_branch2c"
  top: "seg1_res4f_branch2c"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res4f"
  type: "Eltwise"
  bottom: "seg1_res4f_branch2c"
  bottom: "seg1_res4e"
  top: "seg1_res4f"
}
layer {
  name: "seg1_res4f_relu"
  type: "ReLU"
  bottom: "seg1_res4f"
  top: "seg1_res4f"
}
layer {
  name: "seg1_res5a_branch2a"
  type: "Convolution"
  bottom: "seg1_res4f"
  top: "seg1_res5a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    engine: CUDNN
  }
}
layer {
  name: "seg1_bn5a_branch2a"
  type: "BatchNorm"
  bottom: "seg1_res5a_branch2a"
  top: "seg1_res5a_branch2a"
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  param {
    lr_mult: 0
  }
  batch_norm_param {
    use_global_stats: true
  }
}
layer {
  name: "seg1_scale5a_branch2a"
  type: "Scale"
  bottom: "seg1_res5a_branch2a"
  top: "seg1_res5a_branch2a"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  scale_param {
    bias_term: true
  }
}
layer {
  name: "seg1_res5a_branch2a_relu"
  type: "ReLU"
  bottom: "seg1_res5a_branch2a"
